aaron-bond.better-comments
adpyke.vscode-sql-formatter
alefragnani.bookmarks
andenetalexander.vim-cheatsheet
anysphere.cursorpyright
anysphere.remote-wsl
augment.vscode-augment
bbenoist.nix
bierner.markdown-mermaid
catppuccin.catppuccin-vsc
charliermarsh.ruff
christian-kohler.path-intellisense
cweijan.dbclient-jdbc
cweijan.vscode-mysql-client2
detachhead.basedpyright
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
evan-buss.font-switcher
james-yu.latex-workshop
jnoortheen.nix-ide
mechatroner.rainbow-csv
mhutchie.git-graph
mkhl.direnv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
oderwat.indent-rainbow
pinage404.nix-extension-pack
renesaarsoo.sql-formatter-vsc
sirtori.indenticator
snowflake.snowflake-vsc
sourcegraph.amp
streetsidesoftware.code-spell-checker
vscodevim.vim
zainchen.json
